<script>
	export default {
		data () {
			return {
				articles: [
					'锲而舍之，朽木不折；锲而不舍，金石可镂”。成就什么样的人生，核心的问题不在于客观环境等因素，而在于自身内在品质。人生要想有一番作为，必须选择一条适合自己性格的跑道，最好的跑道是那条终生可以为之奋斗的跑道，一旦选择了跑道，就要为之坚持不懈，不要轻易放弃，放弃就是失败。 马云这样说过，“今天很残酷，明天很残酷，后天很美好，但是绝大多数人都‘死’在明天晚上，见不到后天的太阳。',
					'《钢铁是怎么炼成的》小说中保尔?柯察金说：“人最宝贵的东西是生命，生命属于人只有一次，人的一生应当这样度过：当他回首往事的时候，他不因虚度年华而悔恨，也不应碌碌无为而羞愧。”我们对待自己工作与事业要懂得坚持，如果一味地为了与他人攀比，追求安逸、财富与荣耀，而不停地变换工作，最终只能活在理想的美梦里，白白浪费了青春，一事无成。我们只有懂得忠诚与奉献，在平凡的岗位上踏踏实实地工作，坚持不懈，这样，才能在平凡的岗位上，做出不平凡的成就，青春也不会虚度，人生才会有价值。'
				]
			}
		},
		render (h, context) {
			return (
				<div>
				{this.articles.map(article => <article>{article}</article>)}
				</div>
			)
		}
	}
</script>